; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v9 ?v4)
             (pred_4 ?v7 ?v11)
             (pred_9 ?v9 ?v11)
             (pred_11 ?v13 ?v9 )
	     (pred_8 ?v9)
             (pred_12 ?v2)
             (pred_3 ?v7)
             (pred_7 ?v11)
             (pred_2 ?v9)
             (pred_10 ?v7)
             (pred_6 ?v9)
             (pred_5 ))



(:action op_2
:parameters (?v12 ?v3 ?v10 ?v5)
:precondition (and (pred_12 ?v12) (pred_12 ?v3) (pred_3 ?v10) (pred_7 ?v5)
          (pred_1 ?v12 ?v3) (pred_4 ?v10 ?v5)
                   (pred_9 ?v3 ?v5) (pred_8 ?v12) 
                   (pred_2 ?v3) (pred_10 ?v10))
:effect (and  (pred_6 ?v3) (not (pred_2 ?v3))))


(:action op_4
:parameters (?v12 ?v6)
:precondition (and (pred_12 ?v12) (pred_12 ?v6)
               (pred_8 ?v12) (pred_1 ?v12 ?v6) (pred_6 ?v6))
:effect (and (pred_8 ?v6) (not (pred_8 ?v12))))

(:action op_5
:parameters (?v12 ?v10)
:precondition (and (pred_12 ?v12) (pred_3 ?v10) 
                  (pred_8 ?v12) (pred_11 ?v10 ?v12) (pred_5 ))
:effect (and (pred_10 ?v10)
   (not (pred_11 ?v10 ?v12)) (not (pred_5 ))))


(:action op_1
:parameters (?v12 ?v1 ?v8)
:precondition (and (pred_12 ?v12) (pred_3 ?v1) (pred_3 ?v8)
                  (pred_8 ?v12) (pred_10 ?v8) (pred_11 ?v1 ?v12))
:effect (and (pred_10 ?v1) (pred_11 ?v8 ?v12)
        (not (pred_10 ?v8)) (not (pred_11 ?v1 ?v12))))

(:action op_3
:parameters (?v12 ?v10)
:precondition (and (pred_12 ?v12) (pred_3 ?v10) 
                  (pred_8 ?v12) (pred_10 ?v10))
:effect (and (pred_5 ) (pred_11 ?v10 ?v12) (not (pred_10 ?v10)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_06 obj_25 obj_16 obj_05 obj_17 obj_26 obj_24 obj_09 obj_11 obj_03 obj_23 obj_01 obj_14 obj_15 obj_04 obj_12 obj_07 obj_30 obj_13 obj_29 obj_18 obj_20 obj_19 obj_22
    obj_28 obj_02
    obj_21 obj_27 obj_08
    )

    (:init
       (pred_5)

       (pred_12 obj_10)
       (pred_12 obj_06)
       (pred_12 obj_25)
       (pred_12 obj_16)
       (pred_12 obj_05)
       (pred_12 obj_17)
       (pred_12 obj_26)
       (pred_12 obj_24)
       (pred_12 obj_09)
       (pred_12 obj_11)
       (pred_12 obj_03)
       (pred_12 obj_23)
       (pred_12 obj_01)
       (pred_12 obj_14)
       (pred_12 obj_15)
       (pred_12 obj_04)
       (pred_12 obj_12)
       (pred_12 obj_07)
       (pred_12 obj_30)
       (pred_12 obj_13)
       (pred_12 obj_29)
       (pred_12 obj_18)
       (pred_12 obj_20)
       (pred_12 obj_19)
       (pred_12 obj_22)
       (pred_7 obj_28)
       (pred_7 obj_02)
       (pred_3 obj_21)
       (pred_3 obj_27)
       (pred_3 obj_08)

       (pred_1 obj_10 obj_17)
       (pred_1 obj_10 obj_06)
       (pred_1 obj_06 obj_26)
       (pred_1 obj_06 obj_25)
       (pred_1 obj_06 obj_10)
       (pred_1 obj_25 obj_24)
       (pred_1 obj_25 obj_16)
       (pred_1 obj_25 obj_06)
       (pred_1 obj_16 obj_09)
       (pred_1 obj_16 obj_05)
       (pred_1 obj_16 obj_25)
       (pred_1 obj_05 obj_11)
       (pred_1 obj_05 obj_16)
       (pred_1 obj_17 obj_03)
       (pred_1 obj_17 obj_26)
       (pred_1 obj_17 obj_10)
       (pred_1 obj_26 obj_23)
       (pred_1 obj_26 obj_24)
       (pred_1 obj_26 obj_06)
       (pred_1 obj_26 obj_17)
       (pred_1 obj_24 obj_01)
       (pred_1 obj_24 obj_09)
       (pred_1 obj_24 obj_25)
       (pred_1 obj_24 obj_26)
       (pred_1 obj_09 obj_14)
       (pred_1 obj_09 obj_11)
       (pred_1 obj_09 obj_16)
       (pred_1 obj_09 obj_24)
       (pred_1 obj_11 obj_15)
       (pred_1 obj_11 obj_05)
       (pred_1 obj_11 obj_09)
       (pred_1 obj_03 obj_04)
       (pred_1 obj_03 obj_23)
       (pred_1 obj_03 obj_17)
       (pred_1 obj_23 obj_12)
       (pred_1 obj_23 obj_01)
       (pred_1 obj_23 obj_26)
       (pred_1 obj_23 obj_03)
       (pred_1 obj_01 obj_07)
       (pred_1 obj_01 obj_14)
       (pred_1 obj_01 obj_24)
       (pred_1 obj_01 obj_23)
       (pred_1 obj_14 obj_30)
       (pred_1 obj_14 obj_15)
       (pred_1 obj_14 obj_09)
       (pred_1 obj_14 obj_01)
       (pred_1 obj_15 obj_13)
       (pred_1 obj_15 obj_11)
       (pred_1 obj_15 obj_14)
       (pred_1 obj_04 obj_29)
       (pred_1 obj_04 obj_12)
       (pred_1 obj_04 obj_03)
       (pred_1 obj_12 obj_18)
       (pred_1 obj_12 obj_07)
       (pred_1 obj_12 obj_23)
       (pred_1 obj_12 obj_04)
       (pred_1 obj_07 obj_20)
       (pred_1 obj_07 obj_30)
       (pred_1 obj_07 obj_01)
       (pred_1 obj_07 obj_12)
       (pred_1 obj_30 obj_19)
       (pred_1 obj_30 obj_13)
       (pred_1 obj_30 obj_14)
       (pred_1 obj_30 obj_07)
       (pred_1 obj_13 obj_22)
       (pred_1 obj_13 obj_15)
       (pred_1 obj_13 obj_30)
       (pred_1 obj_29 obj_18)
       (pred_1 obj_29 obj_04)
       (pred_1 obj_18 obj_20)
       (pred_1 obj_18 obj_12)
       (pred_1 obj_18 obj_29)
       (pred_1 obj_20 obj_19)
       (pred_1 obj_20 obj_07)
       (pred_1 obj_20 obj_18)
       (pred_1 obj_19 obj_22)
       (pred_1 obj_19 obj_30)
       (pred_1 obj_19 obj_20)
       (pred_1 obj_22 obj_13)
       (pred_1 obj_22 obj_19)
       (pred_2 obj_18)
       (pred_2 obj_03)
       (pred_2 obj_26)
       (pred_9  obj_18 obj_28)
       (pred_9  obj_03 obj_02)
       (pred_9  obj_26 obj_02)
       (pred_6 obj_10)
       (pred_6 obj_06)
       (pred_6 obj_25)
       (pred_6 obj_16)
       (pred_6 obj_05)
       (pred_6 obj_17)
       (pred_6 obj_24)
       (pred_6 obj_09)
       (pred_6 obj_11)
       (pred_6 obj_23)
       (pred_6 obj_01)
       (pred_6 obj_14)
       (pred_6 obj_15)
       (pred_6 obj_04)
       (pred_6 obj_12)
       (pred_6 obj_07)
       (pred_6 obj_30)
       (pred_6 obj_13)
       (pred_6 obj_29)
       (pred_6 obj_20)
       (pred_6 obj_19)
       (pred_6 obj_22)

       (pred_4  obj_21 obj_28)
       (pred_4  obj_27 obj_02)
       (pred_4  obj_08 obj_28)
       (pred_11 obj_21 obj_10)
       (pred_11 obj_27 obj_11)
       (pred_11 obj_08 obj_01)
       (pred_8 obj_20)
    )

    (:goal (and
       (pred_11 obj_21 obj_22)
       (pred_11 obj_27 obj_12)
    ))
(:constraints
  (always (not (pred_8 obj_24)))
)
)

; plan
1. (op_4 obj_20 obj_19)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_19)
   goals met: 0 of 2
2. (op_4 obj_19 obj_22)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_22)
   goals met: 0 of 2
3. (op_4 obj_22 obj_13)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_13)
   goals met: 0 of 2
4. (op_4 obj_13 obj_15)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_15)
   goals met: 0 of 2
5. (op_4 obj_15 obj_11)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_11)
   goals met: 0 of 2
6. (op_5 obj_11 obj_27)
   deleted: (pred_11 obj_27 obj_11) (pred_5)
   added: (pred_10 obj_27)
   goals met: 0 of 2
7. (op_4 obj_11 obj_15)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_15)
   goals met: 0 of 2
8. (op_4 obj_15 obj_13)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_13)
   goals met: 0 of 2
9. (op_4 obj_13 obj_22)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_22)
   goals met: 0 of 2
10. (op_3 obj_22 obj_27)
   deleted: (pred_10 obj_27)
   added: (pred_5) (pred_11 obj_27 obj_22)
   goals met: 0 of 2
11. (op_4 obj_22 obj_13)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_13)
   goals met: 0 of 2
12. (op_4 obj_13 obj_30)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_30)
   goals met: 0 of 2
13. (op_4 obj_30 obj_07)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_07)
   goals met: 0 of 2
14. (op_4 obj_07 obj_01)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_01)
   goals met: 0 of 2
15. (op_5 obj_01 obj_08)
   deleted: (pred_11 obj_08 obj_01) (pred_5)
   added: (pred_10 obj_08)
   goals met: 0 of 2
16. (op_4 obj_01 obj_23)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_23)
   goals met: 0 of 2
17. (op_4 obj_23 obj_12)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_12)
   goals met: 0 of 2
18. (op_3 obj_12 obj_08)
   deleted: (pred_10 obj_08)
   added: (pred_5) (pred_11 obj_08 obj_12)
   goals met: 0 of 2
19. (op_4 obj_12 obj_07)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_07)
   goals met: 0 of 2
20. (op_4 obj_07 obj_30)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_30)
   goals met: 0 of 2
21. (op_4 obj_30 obj_13)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_13)
   goals met: 0 of 2
22. (op_4 obj_13 obj_22)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_22)
   goals met: 0 of 2
23. (op_5 obj_22 obj_27)
   deleted: (pred_11 obj_27 obj_22) (pred_5)
   added: (pred_10 obj_27)
   goals met: 0 of 2
24. (op_4 obj_22 obj_13)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_13)
   goals met: 0 of 2
25. (op_4 obj_13 obj_30)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_30)
   goals met: 0 of 2
26. (op_4 obj_30 obj_07)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_07)
   goals met: 0 of 2
27. (op_4 obj_07 obj_12)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_12)
   goals met: 0 of 2
28. (op_3 obj_12 obj_27)
   deleted: (pred_10 obj_27)
   added: (pred_5) (pred_11 obj_27 obj_12)
   goals met: 1 of 2
29. (op_4 obj_12 obj_23)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_23)
   goals met: 1 of 2
30. (op_4 obj_23 obj_01)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_01)
   goals met: 1 of 2
31. (op_4 obj_01 obj_14)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_14)
   goals met: 1 of 2
32. (op_4 obj_14 obj_09)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_09)
   goals met: 1 of 2
33. (op_4 obj_09 obj_16)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_16)
   goals met: 1 of 2
34. (op_4 obj_16 obj_25)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_25)
   goals met: 1 of 2
35. (op_4 obj_25 obj_06)
   deleted: (pred_8 obj_25)
   added: (pred_8 obj_06)
   goals met: 1 of 2
36. (op_4 obj_06 obj_10)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_10)
   goals met: 1 of 2
37. (op_5 obj_10 obj_21)
   deleted: (pred_11 obj_21 obj_10) (pred_5)
   added: (pred_10 obj_21)
   goals met: 1 of 2
38. (op_4 obj_10 obj_06)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_06)
   goals met: 1 of 2
39. (op_4 obj_06 obj_25)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_25)
   goals met: 1 of 2
40. (op_4 obj_25 obj_16)
   deleted: (pred_8 obj_25)
   added: (pred_8 obj_16)
   goals met: 1 of 2
41. (op_4 obj_16 obj_05)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_05)
   goals met: 1 of 2
42. (op_4 obj_05 obj_11)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_11)
   goals met: 1 of 2
43. (op_4 obj_11 obj_15)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_15)
   goals met: 1 of 2
44. (op_4 obj_15 obj_13)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_13)
   goals met: 1 of 2
45. (op_4 obj_13 obj_22)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_22)
   goals met: 1 of 2
46. (op_3 obj_22 obj_21)
   deleted: (pred_10 obj_21)
   added: (pred_5) (pred_11 obj_21 obj_22)
   goals met: 2 of 2
